In [4]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

# Index Object

In [5]:
# # Create Series with constructor Series( data, index, dtype, copy). If data is an ndarray, 
# then index passed must be of the same length. If no index is passed,
# then by default index will be range(n) where n is array length.
obj = Series(range(3), index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [6]:
# Give variable index in obj
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [7]:
# Give Index from 1
index[1:]

Index(['b', 'c'], dtype='object')

In [8]:
# Don't change value index of series
index[1] = 'd'

TypeError: Index does not support mutable operations

In [9]:
# Create Index with arange(3)
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [10]:
# Create Seies [1.5, -2.5, 0] corespond to index before
obj2 = Series([1.5, -2.5, 0], index=index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [11]:
# comparing between index before and index in obj2
obj2.index is index

True

In [12]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9},\
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}} 
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [13]:
# Check 'Ohio' in columns of frame3
'Ohio' in frame3.columns

True

In [14]:
 # Check 2003 in index of frame3
2003 in frame3.index

False

# Arithmetic and data alignment

In [15]:
# Create Series with constructor Series( data, index, dtype, copy)
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [16]:
# Create Series with constructor Series( data, index, dtype, copy)
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [17]:
# Operator sum of Series
# The internal data alignment introduces NA values in the indices that donâ€™t overlap.
# Missing values propagate in arithmetic computations
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [18]:
# Create with constructor DataFrame( data, index, columns, dtype, copy)
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),\
                 index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [19]:
# Create with constructor DataFrame( data, index, columns, dtype, copy)
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),\
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [20]:
# Adding these together returns a DataFrame 
# whose index and columns are the unions of the ones in each DataFrame
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

# Function application and mapping

In [21]:
# Create with constructor DataFrame( data, index, columns, dtype, copy)
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),\
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.697511 -0.127900  0.843621
Ohio   -0.979001 -0.415707  0.342662
Texas   0.008465  0.871474  0.561550
Oregon -0.200123  0.188150 -0.447281

In [22]:
# absolute for every value of frame
np.abs(frame)

               b         d         e
Utah    0.697511  0.127900  0.843621
Ohio    0.979001  0.415707  0.342662
Texas   0.008465  0.871474  0.561550
Oregon  0.200123  0.188150  0.447281

In [23]:
# A lambda function is a small anonymous function, 
#can take any number of arguments, but can only have one expression
f = lambda x: x.max() - x.min()

In [24]:
# to pass a function f and apply it on every single value of frame
frame.apply(f)

b    1.676512
d    1.287181
e    1.290902
dtype: float64

In [25]:
# to find min, max of values across columns
frame.apply(f, axis=1)

Utah      0.971522
Ohio      1.321664
Texas     0.863009
Oregon    0.635431
dtype: float64

In [26]:
# define function f, and eturn Series with min, max of parameter 
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [27]:
# to find min, max of values across columns
frame.apply(f)

            b         d         e
min -0.979001 -0.415707 -0.447281
max  0.697511  0.871474  0.843621

In [28]:
# limit the length of precision
format = lambda x: '%.2f' % x

In [29]:
# applies a function format that accepts and returns a scalar to every element of frame
frame.applymap(format)

            b      d      e
Utah     0.70  -0.13   0.84
Ohio    -0.98  -0.42   0.34
Texas    0.01   0.87   0.56
Oregon  -0.20   0.19  -0.45

In [30]:
# map() a specified function for each item in an iterable. 
# The item is sent to the function as a parameter
frame['e'].map(format)

Utah       0.84
Ohio       0.34
Texas      0.56
Oregon    -0.45
Name: e, dtype: object

# Sorting and ranking

In [31]:
# Create Series with constructor Series( data, index, dtype, copy)
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [32]:
# Sort by index 
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [33]:
# Create with constructor DataFrame( data, index, columns, dtype, copy)
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],\
                  columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [34]:
# sort by index
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [35]:
# sort by index across columns
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [36]:
# sort by index across columns in descending order
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [37]:
#Create Series with data = [4, 7, -3, 2] in constructor Series( data, index, dtype, copy)
obj = Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [38]:
# sort by value 
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [39]:
# Create Series with data = [4, np.nan, 7, np.nan, -3, 2] in constructor Series( data, index, dtype, copy)
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [40]:
# Sort by value 
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [41]:
# Create DataFrame with data = {'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]} 
# constructor DataFrame( data, index, columns, dtype, copy)
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [42]:
# sort by value on columns b
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [43]:
# sort by value on columns a , b
frame.sort_values(['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [44]:
# Create Series with data = [7, -5, 7, 4, 2, 0, 4] in constructor Series( data, index, dtype, copy)
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [45]:
# The rank() function is used to compute numerical data ranks (1 through n) along axis.
# By default, equal values are assigned a rank that is the average of the ranks of those values
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [46]:
# ranks assigned in order they appear in the array
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [47]:
# highest rank in the group with descending order
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [72]:
# Create DataFrame with data = {'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],'c': [-2, 5, 8, -2.5]} 
# constructor DataFrame( data, index, columns, dtype, copy)
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],\
                   'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [74]:
# rank across columns
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

# Axis indexes with duplicate values

In [50]:
# Create Series with constructor Series( data, index, dtype, copy)
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [51]:
# check elements in index is unique
obj.index.is_unique

False

In [52]:
# Get data rows a in obj
obj['a']

a    0
a    1
dtype: int64

In [53]:
# Get data rows c in obj
obj['c']

4

In [54]:
# Create DataFrame with constructor DataFrame( data, index, columns, dtype, copy)
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.455722  0.342135 -0.745843
a  0.142310 -0.518432  2.101842
b -1.036794 -0.467521  0.472883
b -0.472244 -0.085161  0.651943

In [55]:
# Access group of values using labels 'b'
df.loc['b']

          0         1         2
b -1.036794 -0.467521  0.472883
b -0.472244 -0.085161  0.651943

# Handling Missing Data

In [56]:
# # Create Series with data = ['aardvark', 'artichoke', np.nan, 'avocado'] constructor Series( data, index, dtype, copy)
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [57]:
# check null value 
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [58]:
# set value of row '0' is None
string_data[0] = None

In [59]:
# check null value 
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

# Summary Statistics by Level

In [60]:
# Create DataFrame with constructor DataFrame( data, index, columns, dtype, copy)
frame = DataFrame(np.arange(12).reshape((4, 3)),\
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],\
                  columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [61]:
# Set level name for columns and index
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [62]:
# swaplevel: swap level 'key1' with level 'key2'
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [63]:
# Sum value by level 'key2'
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [64]:
# Sum value by level 'color' across columns
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

# Using a DataFrameâ€™s Columns

In [65]:
# Create DataFrame with constructor DataFrame( data, index, columns, dtype, copy)
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),\
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],\
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [66]:
# It sets the DataFrame index (row labels) 
# using one or more existing columns or arrays (of the correct length). 
#The index can replace the existing index or expand on it
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [67]:
# set index and Not drops the column used for index
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [68]:
# does the opposite of set_index; the hierarchical index levels are are moved into the columns
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1